def round2(num):
    return round(num * 100) / 100


def breakEven(售价=15, 成本=9, 房租=3500, 人工=9000, 水电=3000, 其他=1000):
    print(
        "售价：" + str(售价),
        "成本：" + str(成本),
        "房租：" + str(房租),
        "人工：" + str(人工),
        "水电：" + str(水电),
        "其他：" + str(其他),
    )

    毛利率 = (售价 - 成本) / 售价
    毛利率 = round2(毛利率 * 1000 / 1000)
    print("毛利率：" + str(毛利率) + "%")

    固定成本 = 房租 + 人工 + 水电 + 其他
    print("固定成本：" + str(固定成本))

    盈亏 = 固定成本 / 毛利率
    print("盈亏月：" + str(round2(盈亏)))
    print("盈亏天：" + str(round2(盈亏 / 30)))
    print("盈亏份数：" + str(round2(盈亏 / 30 / 售价)))


breakEven(售价=15, 成本=8, 房租=12500, 人工=12000, 水电=4000, 其他=1000)
print("------------------------------------")
breakEven(售价=17, 成本=9, 房租=3500, 人工=3000 * 2, 水电=3000, 其他=1000)
